app/views/characters/index.html.erb

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
---
        <div class="cs1 1"><%= if @tool_lists.size > 0
								image_tag(Character.find(@tool_lists[0].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
---
        <div class="cs1 2"><%= if @tool_lists.size > 1
								image_tag(Character.find(@tool_lists[1].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
---
        <div class="cs1 3"><%= if @tool_lists.size > 2
								image_tag(Character.find(@tool_lists[2].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
---
        <div class="cs1 4"><%= if @tool_lists.size > 3
								image_tag(Character.find(@tool_lists[3].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
---
        <div class="cs1 5"><%= if @tool_lists.size > 4
								image_tag(Character.find(@tool_lists[4].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
---
        <div class="cs1 6"><%= if @tool_lists.size > 5
								image_tag(Character.find(@tool_lists[5].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 116], ["LIMIT", 1]]
---
        <div class="cs1 7"><%= if @tool_lists.size > 6
								image_tag(Character.find(@tool_lists[6].character_id).avatar.url)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]
---
				  <tr>
					<td><%= Character.find(tool.character_id).name %></td>
					<td><%= image_tag(Character.find(tool.character_id).avatar.url) %></td>