app/controllers/characters_controller.rb

INSERT INTO "characters" ("name", "synergy", "cost", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "qq"], ["synergy", "ssds"], ["cost", 3], ["created_at", "2022-11-14 12:06:04.782341"], ["updated_at", "2022-11-14 12:06:04.782341"], ["avatar", "KakaoTalk_20221113_070637300.png"]]
---
  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save

UPDATE "characters" SET "avatar" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["avatar", "KakaoTalk_20221113_070637300.png"], ["updated_at", "2022-11-14 12:05:30.118625"], ["id", 38]]
---
  def update
    respond_to do |format|
      if @character.update(character_params)

DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 63]]
---
  def destroy
    @character.destroy