app/controllers/characters_controller.rb

  def index
    @characters = Character.all
	@i = 0

	@synergies = Synergy.all

	@tool_lists = Tool.all

	@tool_synergy = []

	@tool_lists.each do |tool|
		@tool_synergy.push(Character.find(tool.character_id).synergy)
		@tool_synergy.push(Character.find(tool.character_id).synergy2)
		@tool_synergy.push(Character.find(tool.character_id).synergy3)
---
SELECT "characters".* FROM "characters"
SELECT "synergies".* FROM "synergies"
SELECT "tools".* FROM "tools"
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("name", "synergy", "cost", "created_at", "updated_at", "synergy2", "synergy3") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "사이펜"], ["synergy", "속삭임"], ["cost", 7], ["created_at", "2022-11-20 11:35:48.813232"], ["updated_at", "2022-11-20 11:35:48.813232"], ["synergy2", "난동꾼"], ["synergy3", "용"]]

  def update
    respond_to do |format|
      if @character.update(character_params)
---
UPDATE "characters" SET "name" = $1, "synergy" = $2, "synergy2" = $3, "cost" = $4, "avatar" = $5, "updated_at" = $6 WHERE "characters"."id" = $7  [["name", "카이사"], ["synergy", "용술사"], ["synergy2", "석호"], ["cost", 2], ["avatar", "KakaoTalk_20221113_070928331.png"], ["updated_at", "2022-11-20 11:50:15.797622"], ["id", 122]]

  def destroy
    @character.destroy
---
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 66]]