app/controllers/synergies_controller.rb

  def index
    @synergies = Synergy.all
---
SELECT "synergies".* FROM "synergies"

  def create
    @synergy = Synergy.new(synergy_params)

    respond_to do |format|
      if @synergy.save
---
INSERT INTO "synergies" ("s_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["s_name", "거석"], ["created_at", "2022-11-19 11:46:38.696404"], ["updated_at", "2022-11-19 11:46:38.696404"]]

  def update
    respond_to do |format|
      if @synergy.update(synergy_params)
---
UPDATE "synergies" SET "s_name" = $1, "updated_at" = $2 WHERE "synergies"."id" = $3  [["s_name", "비취"], ["updated_at", "2022-11-19 11:47:30.697394"], ["id", 6]]

  def destroy
    @synergy.destroy
---
DELETE FROM "synergies" WHERE "synergies"."id" = $1  [["id", 15]]

    def set_synergy
      @synergy = Synergy.find(params[:id])
---
SELECT  "synergies".* FROM "synergies" WHERE "synergies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]