app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def index
    @tools = Tool.all

INSERT INTO "tools" ("character_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["character_id", 1], ["created_at", "2022-11-12 21:44:50.208638"], ["updated_at", "2022-11-12 21:44:50.208638"]]
---
  def create
    @tool = Tool.new(tool_params)

    respond_to do |format|
      if @tool.save

DELETE FROM "tools" WHERE "tools"."id" = $1  [["id", 1]]
---
  def destroy
    @tool.destroy

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tool
      @tool = Tool.find(params[:id])